{
  "_name_or_path": "ibm/MoLFormer-XL-both-10pct",
  "architectures": [
    "MolformerForMaskedLM"
  ],
  "auto_map": {
    "AutoConfig": "ibm/MoLFormer-XL-both-10pct--configuration_molformer.MolformerConfig",
    "AutoModel": "ibm/MoLFormer-XL-both-10pct--modeling_molformer.MolformerModel",
    "AutoModelForMaskedLM": "ibm/MoLFormer-XL-both-10pct--modeling_molformer.MolformerForMaskedLM",
    "AutoModelForSequenceClassification": "ibm/MoLFormer-XL-both-10pct--modeling_molformer.MolformerForSequenceClassification"
  },
  "classifier_dropout_prob": null,
  "classifier_skip_connection": true,
  "deterministic_eval": false,
  "embedding_dropout_prob": 0.2,
  "feature_map_kernel": "relu",
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "initializer_range": 0.02,
  "intermediate_size": 768,
  "layer_norm_eps": 1e-12,
  "linear_attention_eps": 1e-06,
  "max_position_embeddings": 202,
  "model_type": "molformer",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "num_random_features": 32,
  "pad_token_id": 2,
  "tie_word_embeddings": false,
  "torch_dtype": "float32",
  "transformers_version": "4.48.3",
  "vocab_size": 2362
}
